Ran Plan for project: `dev` dir: `dev` workspace: `development`

<details><summary>Show Output</summary>

```diff
Workspace: development
Directory: /opt/data/repos/beantownpub/infrastructure/6/development/dev
total 56
drwx------    8 root     root          4096 Aug 24 17:00 .
drwx------    4 root     root          4096 Aug 24 17:00 ..
-rw-r--r--    1 root     root           589 Aug 24 17:00 .editorconfig
drwxr-xr-x    8 root     root          4096 Aug 24 17:00 .git
drwxr-xr-x    2 root     root          4096 Aug 24 17:00 .github
-rw-r--r--    1 root     root            31 Aug 24 17:00 .gitignore
-rw-r--r--    1 root     root            16 Aug 24 17:00 .tool-versions
-rw-r--r--    1 root     root           390 Aug 24 17:00 Makefile
-rw-r--r--    1 root     root            76 Aug 24 17:00 README.md
-rw-r--r--    1 root     root           602 Aug 24 17:00 atlantis.yaml
drwxr-xr-x    2 root     root          4096 Aug 24 17:00 dev
drwxr-xr-x    6 root     root          4096 Aug 24 17:00 modules
drwxr-xr-x    2 root     root          4096 Aug 24 17:00 prod
drwxr-xr-x    3 root     root          4096 Aug 24 17:00 test
Initializing modules...
- acm in ../modules/acm
Downloading terraform-aws-modules/acm/aws 3.2.0 for acm.acm...
- acm.acm in .terraform/modules/acm.acm
- vpc in ../modules/vpc
Downloading terraform-aws-modules/vpc/aws 3.3.0 for vpc.vpc...
- vpc.vpc in .terraform/modules/vpc.vpc
- web_sg in ../modules/security-group
Downloading terraform-aws-modules/security-group/aws 4.3.0 for web_sg.security_group...
- web_sg.security_group in .terraform/modules/web_sg.security_group

Initializing the backend...

Successfully configured the backend "remote"! Terraform will automatically
use this backend unless the backend configuration changes.

Initializing provider plugins...
- Reusing previous version of hashicorp/aws from the dependency lock file
- Installing hashicorp/aws v3.54.0...
- Installed hashicorp/aws v3.54.0 (signed by HashiCorp)

Terraform has been successfully initialized!

You may now begin working with Terraform. Try running "terraform plan" to see
any changes that are required for your infrastructure. All Terraform commands
should now work.

If you ever set or change modules or backend configuration for Terraform,
rerun this command to reinitialize your working directory. If you forget, other
commands will detect it and remind you to do so if necessary.

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.acm.module.acm.aws_acm_certificate.this[0] will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "jalgraves.com"
      + domain_validation_options = (known after apply)
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = (known after apply)
      + tags                      = {
          + "Name" = "jalgraves.com"
        }
      + tags_all                  = {
          + "Name" = "jalgraves.com"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "EMAIL"

      + options {
          + certificate_transparency_logging_preference = "ENABLED"
        }
    }

  # module.vpc.module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name" = "main"
        }
      + tags_all = {
          + "Name" = "main"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-private-us-east-1a"
        }
      + tags_all         = {
          + "Name" = "main-private-us-east-1a"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name" = "main-public"
        }
      + tags_all         = {
          + "Name" = "main-public"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.1.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = false
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-private-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "main-private-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                             = (known after apply)
      + assign_ipv6_address_on_creation = false
      + availability_zone               = "us-east-1a"
      + availability_zone_id            = (known after apply)
      + cidr_block                      = "10.0.101.0/24"
      + id                              = (known after apply)
      + ipv6_cidr_block_association_id  = (known after apply)
      + map_public_ip_on_launch         = true
      + owner_id                        = (known after apply)
      + tags                            = {
          + "Name" = "main-public-us-east-1a"
        }
      + tags_all                        = {
          + "Name" = "main-public-us-east-1a"
        }
      + vpc_id                          = (known after apply)
    }

  # module.vpc.module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                              = (known after apply)
      + assign_generated_ipv6_cidr_block = false
      + cidr_block                       = "10.0.0.0/16"
      + default_network_acl_id           = (known after apply)
      + default_route_table_id           = (known after apply)
      + default_security_group_id        = (known after apply)
      + dhcp_options_id                  = (known after apply)
      + enable_classiclink               = (known after apply)
      + enable_classiclink_dns_support   = (known after apply)
      + enable_dns_hostnames             = false
      + enable_dns_support               = true
      + id                               = (known after apply)
      + instance_tenancy                 = "default"
      + ipv6_association_id              = (known after apply)
      + ipv6_cidr_block                  = (known after apply)
      + main_route_table_id              = (known after apply)
      + owner_id                         = (known after apply)
      + tags                             = {
          + "Name" = "main"
        }
      + tags_all                         = {
          + "Name" = "main"
        }
    }

  # module.web_sg.module.security_group.aws_security_group.this_name_prefix[0] will be created
  + resource "aws_security_group" "this_name_prefix" {
      + arn                    = (known after apply)
      + description            = "Security group for web ingress"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "web-sg-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "web-sg"
        }
      + tags_all               = {
          + "Name" = "web-sg"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 11 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /opt/data/repos/beantownpub/infrastructure/6/development/dev/dev-development.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "/opt/data/repos/beantownpub/infrastructure/6/development/dev/dev-development.tfplan"

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p dev`
* :put_litter_in_its_place: To **delete** this plan click [here](https://bbd93bc43499.ngrok.io/lock?id=beantownpub%252Finfrastructure%252Fdev%252Fdevelopment)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p dev`
</details>
Plan: 11 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
